#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_service_discovery_http_namespace.namespace: Refreshing state... [id=ns-d27rejx4couw5als]
aws_vpc.this: Refreshing state... [id=vpc-0a4672ac46effdfa1]
aws_kms_key.custom_kms_key: Refreshing state... [id=bb68b1d6-c32e-4451-806a-921461e4e9fb]
data.aws_availability_zones.available: Reading...
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
aws_kms_alias.key: Refreshing state... [id=alias/app-weather]
aws_ecr_repository.api_container: Refreshing state... [id=app-weather-api]
aws_kms_key_policy.encrypt_app: Refreshing state... [id=bb68b1d6-c32e-4451-806a-921461e4e9fb]
aws_cloudwatch_log_group.service_connect_logs: Refreshing state... [id=/amazon-ecs/app-weather/service-connect]
aws_ecr_repository.web_container: Refreshing state... [id=app-weather-web]
aws_secretsmanager_secret.ecs_secret: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:ecs_secret_app-weather-EXHwy4]
aws_cloudwatch_log_group.logs: Refreshing state... [id=/amazon-ecs/app-weather/log]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:us-east-2:743794601996:cluster/app-weather]
aws_secretsmanager_secret_version.ecs_secret_version: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:ecs_secret_app-weather-EXHwy4|terraform-20241214174209074600000003]
aws_default_security_group.default: Refreshing state... [id=sg-041395efa4445e9f5]
aws_internet_gateway.this_igw: Refreshing state... [id=igw-0be1c340918133b77]
aws_subnet.public[0]: Refreshing state... [id=subnet-0830e0ca62080c581]
aws_route_table.this_rt: Refreshing state... [id=rtb-02bbf5901ddb3f50e]
aws_security_group.container_sg: Refreshing state... [id=sg-0da63b35d4eabecee]
aws_subnet.public[1]: Refreshing state... [id=subnet-08ee0b91a5f9d6900]
aws_security_group.endpoint_sg: Refreshing state... [id=sg-0f908ca23a7508b36]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-weather/509f8a2af7c64518]
aws_route_table.this_rt_private: Refreshing state... [id=rtb-0628cf5bfda25f054]
aws_security_group.custom_sg: Refreshing state... [id=sg-0211a272c0b41a2fd]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-04766720d62b46561]
aws_subnet.private[0]: Refreshing state... [id=subnet-097abde68839a78a7]
aws_subnet.private[1]: Refreshing state... [id=subnet-0d4a6bb23a2bdedfd]
aws_security_group_rule.ingress_vpc_endpoint: Refreshing state... [id=sgrule-3888207563]
aws_security_group_rule.egress_container: Refreshing state... [id=sgrule-3097792632]
aws_route.internet_route: Refreshing state... [id=r-rtb-02bbf5901ddb3f50e1080289494]
aws_security_group_rule.ingress_load_balancer: Refreshing state... [id=sgrule-2321667585]
aws_security_group_rule.ingress_container: Refreshing state... [id=sgrule-1302848237]
aws_security_group_rule.egress_load_balancer: Refreshing state... [id=sgrule-3636111681]
aws_lb.app_lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:loadbalancer/app/app-weather/c2ecf69bbae2469c]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-086dd3b631d809273]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0b20ad66656ae918b]
aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-09bf67ac5b6226a32]
aws_vpc_endpoint.cloudwatch: Refreshing state... [id=vpce-0afa5b8c39584c3c2]
aws_vpc_endpoint.secrets_manager: Refreshing state... [id=vpce-02c479eb5f4b2fb4d]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-07cededa4cfa44575]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-02866bb7720423fda]
aws_vpc_endpoint_route_table_association.s3_association: Refreshing state... [id=a-vpce-04766720d62b465613985809231]
aws_vpc_endpoint.ecr: Refreshing state... [id=vpce-0df60e6d9762489ac]
aws_alb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:listener/app/app-weather/c2ecf69bbae2469c/4ceb807f1c78550c]
aws_ssm_parameter.infra_output: Refreshing state... [id=/app-weather/output]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_alb_listener.listener will be updated in-place
  ~ resource "aws_alb_listener" "listener" {
        id                = "arn:aws:elasticloadbalancing:us-east-2:743794601996:listener/app/app-weather/c2ecf69bbae2469c/4ceb807f1c78550c"
        tags              = {}
        # (6 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-weather/509f8a2af7c64518" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb_target_group.target_group must be replaced
-/+ resource "aws_lb_target_group" "target_group" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-weather/509f8a2af7c64518" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/app-weather/509f8a2af7c64518" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-weather/509f8a2af7c64518" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:us-east-2:743794601996:loadbalancer/app/app-weather/c2ecf69bbae2469c",
        ] -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "app-weather"
      + name_prefix                        = (known after apply)
      ~ port                               = 8080 -> 80 # forces replacement
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
        # (8 unchanged attributes hidden)

      ~ health_check {
          ~ timeout             = 5 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ stickiness (known after apply)
      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
            # (1 unchanged attribute hidden)
        }

      ~ target_failover (known after apply)
      - target_failover {}

      ~ target_group_health (known after apply)
      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      ~ target_health_state (known after apply)
      - target_health_state {}
    }

  # aws_security_group_rule.ingress_container must be replaced
-/+ resource "aws_security_group_rule" "ingress_container" {
      ~ from_port                = 8080 -> 80 # forces replacement
      ~ id                       = "sgrule-1302848237" -> (known after apply)
      ~ security_group_rule_id   = "sgr-03ed30283cfec4044" -> (known after apply)
      ~ to_port                  = 8080 -> 80 # forces replacement
        # (6 unchanged attributes hidden)
    }

  # aws_ssm_parameter.infra_output will be updated in-place
  ~ resource "aws_ssm_parameter" "infra_output" {
        id              = "/app-weather/output"
      + insecure_value  = (known after apply)
        name            = "/app-weather/output"
        tags            = {}
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*